pytrustnfe/nfse/niteroi/templates/GerarNfse.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:GerarNfseRequest xmlns:ns2="http://nfse.abrasf.org.br">
            <nfseCabecMsg>
                <![CDATA[<?xml version='1.0' encoding='utf-8'?>
                <cabecalho versao="2.03" 
                    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
                    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                    xmlns="http://www.abrasf.org.br/nfse.xsd"
                    versao="2.03">
                    <versaoDados>2.03</versaoDados>
                </cabecalho> ]]>
            </nfseCabecMsg>
            <nfseDadosMsg>
                 <![CDATA[<?xml version='1.0' encoding='utf-8'?>
                <GerarNfseEnvio xmlns="http://192.168.1.156:8752">
                    {% include 'Rps.xml' %}
                </GerarNfseEnvio> ]]>
            </nfseDadosMsg>
        </ns2:GerarNfseRequest>
    </S:Body>
</S:Envelope>